app/controllers/treasures_controller.rb

SELECT "treasures".* FROM "treasures"
---
  def index
    @treasures = Treasure.all

INSERT INTO "treasures" ("description", "created_at", "updated_at", "status") VALUES (?, ?, ?, ?)  [["description", "Some new one"], ["created_at", "2015-09-15 20:00:42.068291"], ["updated_at", "2015-09-15 20:00:42.068291"], ["status", "PENDING"]]
---
  def create
    @treasure = Treasure.new(treasure_params)

    respond_to do |format|
      if @treasure.save

DELETE FROM "treasures" WHERE "treasures"."id" = ?  [["id", 2]]
---
  def destroy
    @treasure.destroy

SELECT  "treasures".* FROM "treasures" WHERE "treasures"."id" = ? LIMIT 1  [["id", 2]]
---
    def set_treasure
      @treasure = Treasure.find(params[:id])